<?php
// PHP7/HTML5, EDGE/CHROME                                 *** iHtmlEnd.php ***

// ****************************************************************************
// *  ByHeart                            Загрузить завершение HTML для PhpIni * 
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  24.01.2020
// Copyright © 2020 tve                              Посл.изменение: 25.01.2020

?>
   </body> 
   </html>
<?php

// *********************************************************** iHtmlEnd.php ***
