<?php namespace prown;

// PHP7/HTML5, EDGE/CHROME                            *** StringFilters.php ***

// ****************************************************************************
// * TPHPPROWN            Фильтры для обработки строк ("вырезания") с помощью *
// *                                                            функции strtr *
// *                                                                          *
// *                        $trans = array("hello" => "hi", "hi" => "hello"); *
// *                        echo strtr("hi all, I said hello", $trans);       *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  30.01.2018
// Copyright © 2018 tve                              Посл.изменение: 28.02.2018

/* 
   "не фамильные символы" => "non-family symbols"
*/
// Массив символов, которые исключаются из фамилий, инициалов
$aNonFamys=array
(
    "~"  => "", "`"  => "", "!"  => "", "@"  => "", "\"" => "", "#"  => "",
    "№"  => "", "$"  => "", ";"  => "", "%"  => "", "^"  => "", ":"  => "",
    "&"  => "", "?"  => "", "*"  => "", "("  => "", ")"  => "", "_"  => "",
    "+"  => "", "="  => "", "{"  => "", "}"  => "", "["  => "", "]"  => "",
    "|"  => "", "\\" => "", "/"  => "", "'"  => "", "<"  => "", ">"  => "",
    ","  => "", "0"  => "", "1"  => "", "2"  => "", "3"  => "", "4"  => "",
    "5"  => "", "6"  => "", "7"  => "", "8"  => "", "9"  => ""
);
//echo "<br>".'outStringFilters';

// ****************************************************** StringFilters.php *** 

