/* ========================================================================= */
/*   LCD1602aWithI2C.ino                                                     */
/*   (c) 2024-01-27 Труфанов Владимир                                        */
/*                                                                           */
/*   Description:            проверка подключения дисплея LCD1602a через I2C */
/*                           в различных версиях Arduino IDE: 1.8.18 и 2.2.1 */
/* ========================================================================= */

// Подключаем штатные библиотеки Wire.h и LiquidCrystal_I2C.h
#include <Wire.h>
#include <LiquidCrystal_I2C.h> 
 
LiquidCrystal_I2C lcd(0x27,16,2);   // задали адрес и размер дисплея
 
void setup()
{
  lcd.init();                       // проинициализировали lcd    
  lcd.backlight();                  // включили подсветку
  lcd.setCursor(0,0);               // установили курсор в начало 1 строки
  lcd.print("Hello, world");        // вывели текст
  lcd.setCursor(0,1);               // установили курсор в начало 2 строки
  lcd.print("http://doortry.ru");   // вывели текст
}
void loop()
{
}
